IdentityQueryEvents
| where Protocol == @"Ldap"
| where Query == @"LDAP Search Scope: ""WholeSubtree"", Base Object: ""DC=msdemo,DC=local"", Search Filter:  "" (adminCount=1) """


//https://blog.netwrix.com/2022/09/30/admincount_attribute/
