//This is useful to check for shadow credentials on machine accounts:
IdentityQueryEvents
| where Protocol == @"Ldap"
| where Query == @"LDAP Search Scope: ""WholeSubtree"", Base Object: ""DC=msdemo,DC=local"", Search Filter:  "" (msDS-KeyCredentialLink=*) """
