Detects and reports on clear text LDAP queries and authentication.

IdentityLogonEvents
| where Timestamp > ago(7d)
| where LogonType == "LDAP cleartext" and isnotempty(AccountName)
| summarize Count = count() by DeviceName, AccountName, Application, LogonType
